[
  {
    "date":"24/02/2023 - 00:10",
    "author":"FoxWorn3365",
    "role":"SmallCode Founder",
    "title":"We are almost at v1.0!",
    "tags":["pre-relase","smallcode","v1.0","near-relase"],
    "text":"I didn't believe it either, but after a month or so of downtime, I went back to developing this programming language for various reasons. However I am here to tell you that I have finally implemented decent library management that turns out to be similar to methods. The libraries will have to be written in PHP but can obviously be used in SmallCode. I have already updated the documentation, you will know more shortly  -Fox",
    "buttons":[
      {
        "text":"SmallCode Lib Examples",
        "link":"/docs/examples/main"
      },
      { 
        "text":"Dev Branch on GitHub",
        "link":"https://github.com/FoxWorn3365/SmallCode/tree/dev"
      }
    ]
  },
  {
    "date":"31/12/2022 - 23:28",
    "author":"FoxWorn3365",
    "role":"SmallCode Founder",
    "title":"We are near the relase of v1.0",
    "tags":["pre-relase","smallcode","v1.0","near-relase"],
    "text":"It has been a while since SmallCode has been in development and, in some, albeit rare, cases it is also in production. During all this time, as you can see from GitHub, we have not been idle but have continued to update the language, making it more stable, resilient and complete. In fact, to celebrate the release of v1.0 I also implemented... drum roll the new statements. Now if, else, and elseif are better managed and I removed about 20 global variables, all now reduced to simple objects where necessary. Another interesting feature was the implementation of the possibility to use 'storage' for variables different from the default one. Small spoiler: v1.0 will be released with a beautiful included package manager, so you will finally be able to create packages for smallcode. I wish you a good evening. -Fox",
    "buttons":[
      {
        "text":"See SmallCode Examples",
        "link":"/docs/examples/main"
      },
      { 
        "text":"Dev Branch on GitHub",
        "link":"https://github.com/FoxWorn3365/SmallCode/tree/dev"
      }
    ]
  },
  {
    "date":"27/12/2022 - 23:42",
    "author":"FoxWorn3365",
    "role":"SmallCode Founder",
    "title":"SmallCode v0.9 is now out!",
    "tags":["relase","smallcode"],
    "text":"Finally after a long time the v0.9 version as well as the first version of SmallCode is officially out. This is the first complete release, thanks to the month of work behind the stability and speed of SmallCode and obviously also 'designing' the language was not a trivial matter since it had to be done differently from other programming languages. Having said that, it is now possible to download SmallCode v0.9 using the buttons below this news and of course report any bugs on the official SmallCode repository",
    "buttons":[
      {
        "text":"Download SmallCode v0.9",
        "link":"/download"
      },
      { 
        "text":"GitHub Repository",
        "link":"https://github.com/FoxWorn3365/SmallCode"
      }
    ]
  }
]
